ishiyakazuo/CH551-4NES4SNES/main.c
typedef unsigned char*         PUINT8;
typedef unsigned char volatile UINT8V;

#include "ch554.h"
#include "debug.h"
#include "fournsnes.h"
#include <stdio.h>
#include <string.h>
#include <ch554_usb.h>

uint32_t millis, last;

#define PORT1REG 0x90
#define PORT2REG 0xA0
#define PORT3REG 0xB0

#define LED_PIN1 0
SBIT(LED1, PORT3REG, LED_PIN1);

#define MULTITAP_PIN 1
#define LATCH_PIN 2 // P3.2
#define CLOCK_PIN 3 // P3.3
#define DATA0_PIN 4 // P1.4
#define DATA1_PIN 5 // P1.5
#define DATA2_PIN 6 // P1.6
#define DATA3_PIN 7 // P1.7

__xdata __at (0x0000) uint8_t  Ep0Buffer[64];
__xdata __at (0x0040) uint8_t  Ep4Buffer[16];
__xdata __at (0x0080) uint8_t  Ep1Buffer[16];
__xdata __at (0x00C0) uint8_t  Ep2Buffer[16];
__xdata __at (0x0100) uint8_t  Ep3Buffer[16];

uint8_t SetupReq,SetupLen,Ready,Count,UsbConfig;
PUINT8  pDescr;
USB_SETUP_REQ   SetupReqBuf;

void mTimer0Interrupt( void ) __interrupt (INT_NO_TMR0)
{
	TH0 = (65536 - 2000)/256;  // Reload
	TL0 = (65536 - 2000)%256;  // Reload
	millis++;
}

#define	BIT0 (0X01)
#define	BIT1 (0X02)
#define	BIT2 (0X04)
#define	BIT3 (0X08)
#define	BIT4 (0X10)
#define	BIT5 (0X20)
#define	BIT6 (0X40)
#define	BIT7 (0X80)

#define UsbSetupBuf     ((PUSB_SETUP_REQ)Ep0Buffer)

__code uint8_t DevDesc[18] = {
	18, // length (18)
	0x01, // Descriptor type
	0x10,0x01, // USB version (1.1)
	0x00, // class
	0x00, // subclass
	0x00, // protocol
	0x08, // Max packet size
	0x50,0x1D, // VID 0x1D50 (OpenMoko)
	0x2D,0x60, // PID 0x602D (5nes5snes (4x12))
	0x00,0x00, // Device version
	0x03, // manufacturer string index
	0x02, // product string index
	0x00, // S/N string index
	0x01 // # of configurations
};

// Decoder ring for below descriptors
/*
9,          // sizeof(usbDescrInterface): length of descriptor in bytes
0x04, // descriptor type
0,          // index of this interface
0,          // alternate setting for this interface
1,   // endpoints excl 0: number of endpoint descriptors to follow
3, // class
0, // subclass
0, // protocol
1,          // string index for interface

9,          // sizeof(usbDescrHID): length of descriptor in bytes
0x21,   // descriptor type: HID
0x11, 0x01, // BCD representation of HID version
0x00,       // target country code
0x01,       // number of HID Report (or other HID class) Descriptor infos to follow
0x22,       // descriptor type: report
REP_DESC_LEN, 0,  // total length of report descriptor

7,          // sizeof(usbDescrEndpoint)
5,  // descriptor type = endpoint
0x81,       // IN endpoint number 1
0x03,       // attrib: Interrupt endpoint
8, 0,       // maximum packet size
10, // in ms
*/
// poll interval of host in milliseconds
#define POLL_INTERVAL 2

#define CFG_DESC_LEN (9+((9+9+7)*NUM_GAMEPADS))
#if (NUM_BUTTONS % 8)
#define REP_DESC_LEN 49
#else
#define REP_DESC_LEN 45
#endif
#define CFG_INTERFACE_DESCR(a)  0x09,0x04,a,0x00,0x01,0x03,0x00,0x00,0x01
#define CFG_HID_DESCR  0x09,0x21,0x11,0x01,0x00,0x01,0x22,REP_DESC_LEN,0x00
#define CFG_EP_DESCR(a) 0x07,0x05,a,0x03,0x08,0x00,POLL_INTERVAL

__code uint8_t CfgDesc[CFG_DESC_LEN] =
{
    9,   /* sizeof(usbDescriptorConfiguration): length of descriptor in bytes */
    0x02,    /* descriptor type */
    CFG_DESC_LEN,
    0,       /* total length of data returned (including inlined descriptors) */
    NUM_GAMEPADS,          /* number of interfaces in this configuration */
    1,          /* index of this configuration */
    0,          /* configuration name string index */
    0xA0, // USBATTR_BUSPOWER + USBATTR_REMOTEWAKE
    100/2,            /* max USB current in 2mA units */
/* interface descriptor follows inline: */

    CFG_INTERFACE_DESCR(0),
    CFG_HID_DESCR,
    CFG_EP_DESCR(0x81),
#if NUM_GAMEPADS > 1
    CFG_INTERFACE_DESCR(1),
    CFG_HID_DESCR,
    CFG_EP_DESCR(0x82),
#endif
#if NUM_GAMEPADS > 2
    CFG_INTERFACE_DESCR(2),
    CFG_HID_DESCR,
    CFG_EP_DESCR(0x83),
#endif
#if NUM_GAMEPADS > 3
    CFG_INTERFACE_DESCR(3),
    CFG_HID_DESCR,
    CFG_EP_DESCR(0x84)
#endif
};

/*
0x05, 0x01, \			// USAGE_PAGE (Generic Desktop)
0x09, 0x04, \			// USAGE (Joystick)
0xa1, 0x01, \			//	COLLECTION (Application)
  0x09, 0x01, \			//		USAGE (Pointer)
  0xa1, 0x00, \			//		COLLECTION (Physical)
    0x85, a, \			  //			REPORT_ID (a)
    0x09, 0x30, \			  //			USAGE (X)
    0x09, 0x31, \			  //			USAGE (Y)
    0x15, 0x00, \			  //			LOGICAL_MINIMUM (0)
    0x26, 0xff, 0x00, \	//		  LOGICAL_MAXIMUM (255)
    0x75, 0x08, \			  //			REPORT_SIZE (8)
    0x95, 0x02, \			  //			REPORT_COUNT (2)
    0x81, 0x02, \			  //			INPUT (Data,Var,Abs)
    0x05, 0x09, \			  //			USAGE_PAGE (Button)
    0x19, 1, \			    //   		USAGE_MINIMUM (Button 1)
    0x29, NUM_BUTTONS, \			    //   		USAGE_MAXIMUM (Button X = NUM_BUTTONS)
    0x15, 0x00, \			  //   		LOGICAL_MINIMUM (0)
    0x25, 0x01, \			  //   		LOGICAL_MAXIMUM (1)
    0x75, 1, \			    // 			REPORT_SIZE (1)
    0x95, NUM_BUTTONS, \			    //			REPORT_COUNT (NUM_BUTTONS)
    0x81, 0x02, \			  //			INPUT (Data,Var,Abs)

// It might have the following, if the number of buttons isn't a multiple of 8
// (Windows requires byte alignment.)
    0x95, X, \			    //			REPORT_COUNT (X)
    0x81, 0x03, \			  //			INPUT (Const,Var,Abs)

  0xc0, \				//		END_COLLECTION
0xc0 // END_COLLECTION
*/
#if (NUM_BUTTONS % 8) // Need to add byte alignment
#define BUTTON_BYTE_ALIGNMENT 0x95,(8-(NUM_BUTTONS%8)),0x81,0x03,
#else
#define BUTTON_BYTE_ALIGNMENT
#endif
#define GAMEPAD_REPORT_DESCRIPTOR(a) 0x05,0x01,0x09,0x04,0xA1,0x01, \
	0x09,0x01,0xA1,0x00, \
		0x85,a, \
  			0x09,0x30,0x09,0x31,0x15,0x00,0x26,0xFF,0x00,0x75,0x08,0x95,0x02,0x81,0x02, \
			0x05,0x09,0x19,0x01,0x29,NUM_BUTTONS,0x15,0x00,0x25,0x01,0x75,0x01,\
      0x95,NUM_BUTTONS,0x81,0x02,BUTTON_BYTE_ALIGNMENT \
		0xC0, \
	0xC0

// These descriptors are absolutely identical except for the report ID field, hence the #define above.
__code uint8_t ControllerRepDesc[NUM_GAMEPADS][REP_DESC_LEN] = {
  {GAMEPAD_REPORT_DESCRIPTOR(1)},
  #if NUM_GAMEPADS > 1
  {GAMEPAD_REPORT_DESCRIPTOR(2)},
  #endif
  #if NUM_GAMEPADS > 2
  {GAMEPAD_REPORT_DESCRIPTOR(3)},
  #endif
  #if NUM_GAMEPADS > 3
  {GAMEPAD_REPORT_DESCRIPTOR(4)}
  #endif
};

// Language Descriptor
__code uint8_t LangDesc[] = {
	4, 0x03,		// Length = 4 bytes, String Descriptor (0x03)
	0x09, 0x04	// 0x0409 English - United States
};

// String Descriptors:
__code uint8_t DevName1[] = {
	34, 0x03, 	// Length = 34 bytes, String Descriptor (0x03)
	'N', 0,
	'E', 0,
	'S', 0,
	'/', 0,
	'S', 0,
	'N', 0,
	'E', 0,
	'S', 0,
	' ', 0,
	'G', 0,
	'a', 0,
	'm', 0,
	'e', 0,
	'p', 0,
	'a', 0,
	'd', 0
};

__code uint8_t ProductName[] = {
	20, 0x03, 	// Length = 20 bytes, String Descriptor (0x03)
	'0'+NUM_GAMEPADS, 0,
	'N', 0,
	'E', 0,
	'S', 0,
	'0'+NUM_GAMEPADS, 0,
	'S', 0,
	'N', 0,
	'E', 0,
	'S', 0
};

